# поиск машинного эпсилон

m = 0
eps = 1.0

while 1 + eps > 1:
    m += 1
    eps /= 2
m -= 1
print("Машинный эпсилон: ", 2**(-m), "\nСтепень машинного эпсилон: ", m)

# поиск порога машинного нуля

m = 0
y = 1.0

while y != 0:
    y /= 2
    m += 1
m -= 1
print("Порог машинного нуля: ", 2**(-m), "\nСтепень машинного нуля: ", m)

# поиск порога машинной бесконечности

m = 0
y = 1.0

try:
    while True:
        m += 1
        y = 2.0 ** m
except:
    m -= 1
    print("Порог машинной бесконечности: ", 2**m, "\nСтепень машинной бесконечности: ", m)
